/*
 Localizable.strings
 Owncloud iOs Client
 
 Created by Javier Gonzalez on 7/17/12.
 */

/*
 Copyright (C) 2016, ownCloud GmbH.
 This code is covered by the GNU Public License Version 3.
 For distribution utilizing Apple mechanisms please see https://owncloud.org/contribute/iOS-license-exception/
 You should have received a copy of this license
 along with this program. If not, see <http://www.gnu.org/licenses/gpl-3.0.en.html>.
 */


//First Screen
"go_to_login" = "Nustatyti paskyrą";
"you_need_an_account" = "Nėra $appname paskyrų tavo įrenginyje.\nJei norite naudotis šia programėle, turite sukurti paskyra.";

//Login Screen
"testing_connection" = "Bandomas sujungimas";
"server_instance_not_found" = "Nerastas serveris";
"secure_connection_established" = "Secure Connection";
"https_non_secure_connection_established" = "Peradresavimas į nesaugų kelią";
"connection_established" = "Non-secure Connection";
"login_details" = "Prisijungimo duomenys";
"username" = "Prisijungimo vardas";
"password" = "Slaptažodis";
"login" = "Prisijungti";
"cancel" = "Atšaukti";
"error_login_message" = "Neteisingas slaptažodis arba vartotojo vardas";
"error_updating_predefined_url" = "Serveris persikelė į naują URL. Prašome dar kartą patvirtinti tapatybę ir atnaujinti paskyrą.";
"ok" = "Gerai";
"url_sample" = "Serverio adresas ";
"forbidden_characters_in_password" = "Slaptažodis turi neleistinų simbolių";
"server" = "Serveris";
"url" = "URL";
"session_expired" = "Jūsų sesijos laikas baigėsi. Prašome prisijungti iš naujo";
"credentials_different_user" = "Įvestas vartotojas neatitinka šios paskyros vartotojo";
"auth_unsupported_auth_method" = "Serveris nepalaiko šio autentikacijos metodo";
"server_does_not_give_user_id" = "Serveris negražina tinkamo vartotojo ID, susisiekite su administratoriumi";
"authentification_not_valid" = "Nepavyko autorizuotis į serverį";
"error_too_many_http_redirects" = "Klaida bandant prisijungti, pabandykite dar kartą vėliau";
"retry" = "Pakartoti";
"help_link_login" = "Niekada nesinaudojote $appname?";
"error_could_not_add_account" = "Could not store user information. Please try again.";
"account_not_new" = "To paties vartotojo ir serverio paskyra jau egzistuoja šiame įrenginyje";
"oauth2_error_access_denied" = "Autorizacijos serveris draudžia priėjimą";
"oauth2_error" = "Autorizacija nesėkminga";

//TabBarItems
"settings"="Nustatymai";
"files_tab"="Failai";

//Uploading
"upload" = "Įkelti";
"account" = "Paskyra";
"location" = "Vieta:";
"photo_albums" = "Nuotraukų Albumai";
"loading" = "Įkeliama ...";
"no_access_to_gallery" = "Prašome leisti $appname prieiti prie jūsų nuotraukų ir video. Tai galite padaryti nueidami į Nustatymai > Privatumas > Nuotraukos.";
"error" = "Klaida";
"upload_failed"="Nusiuntimas nepavyko";
"redirection_problem"="URL nukreipimas nėra palaikomas";
"all_photos" = "Visos Nuotraukos";

//First View
"menu_upload" = "Įkelti Nuotrauką/Video";
"menu_folder" = "Naujas aplankas";
"menu_text_file" = "Naujas tekstinis failas";
"sort_menu_title" = "Rikiuoti";
"sort_menu_by_name_option" = "A-Z";
"sort_menu_by_modification_date_option" = "Naujausi-Seniausi";
"sort_menu_by_kind_option" = "Kind";

//Create/Edit File Text
"create_text_file" = "Sukurti naują teksto failą";
"title_view_new_text_file" = "Naujas tekstinis failas";
"title_view_edit_text_file" = "Redaguoti tekstinį failą";
"default_text_file_title" = "Naujas tekstinis failas";
"title_text_file_placeholder" = "Pavadinimas...";
"body_text_file_placeholder" = "...";
"error_text_file_exist" = "jau egzistuoja";
"error_file_name_empty" = "Failo pavadinimas negali būti tuščias.";
"no_changes_made" = "Nebuvo atlikti jokie pakeitimai";
"no_file_downloaded" = "Šis failas nėra atsiųstas, jo redaguoti negalite";


//Create Folder
"create_folder" = "Sukurti aplanką";
"folder_name" = "Įveskite aplanko pavadinimą";
"save" = "Išsaugoti";
"folder_exist" = "Aplankas tokiu pavadinimu jau yra. Pasirinkite kitą pavadinimą.";
"folder_create_error"="Aplanko sukurti nepavyko";
"not_show_potrait"="Meniu negalimas horizontaliame režime. Perjunkite į vertikalų.";
"not_possible_create_folder" = "Aplanko sukurti nepavyko";

//FilesView
"confirm_to_delete_item" = "Patvirtinkite įrašo trynimą";
"yes" = "Taip";
"no" = "Ne";
"delete_from_device" = "Ar tikrai norite pašalinti šį failą iš įrenginio?";
"delete_from_server" = "Ar tikrai norite pašalinti šį failą iš serverio?";
"not_possible_connect_to_server" = "Šiuo metu neįmanoma prisijungti prie serverio.";
"delete_folder_from_server" = "Ar tikrai norite pašalinti šį aplanką iš serverio?";
"delete_local_server" = "ištrinti iš įrenginio ir serverio";
"delete_local" = "Ištrinti iš įrenginio";
"delete_server" = "Ištrinti iš serverio";
"error_path" = "Not found. Please make sure it exists";
"error_not_permission" = "Jūs neturite leidimo šiam veiksmui";
"folders" = "katalogai";
"files" = "failas";
"folder" = "katalogas";
"file" = "failas";
"more_swipe" = "Daugiau";
"message_not_files" = "Čia tuščia. Įkelkite ką nors!";
"maintenance_mode_on_server_message" = "Šiuo metu neįmanoma prisijungti prie serverio. Šiuo metu serveris tvarkomas.";

//Refresh file list
"release_refresh"="Paleiskite atnaujinimui...";
"loading_refresh"="Įkeliama ...";
"pull_down_refresh"="Tempkite žemyn norėdami atnaujinti.";

//Miscelanea
"back" = "Atgal";

//Preview
"open_with_label" = "Atverti naudojant";
"delete_label"= "Ištrinti";

//Open with
"file_cannot_be_opened" = "Failas negali būti atidarytas";
"no_app_instaled_to_open_it" = "Nėra įdiegta jokia programėlė, kuri galėtų atvertį šį failo tipą.";

//WTClient messages (Download/Upload)
"establishing_connection" = "Jungiamasi";
"not_establishing_connection" = "Prisijungti nepavyko";
"connection_closed" = "Prisijungimas baigtas";
"connection_lost" = "Prisijungimas nutrūko";
"auth_failed" = "Autentikacija nepavyko.";
"auth_passed" = "Autentikacija priimta";
"request_file_not_found" = "Šis failas nerastas serveryje";
"request_file_not_accesed" = "Šis failas nepasiekiamas";
"unknow_response_server" = "Klaida. Nesuprantamas atsakymas iš serverio.";
"uploading_data" = "Įkeliami duomenys";
"downloading_data" = "Atsisiunčiami duomenys";
"transfer_complete" = "Siuntimas baigtas";
"transfer_failed" = "Siuntimas nepavyko";
"download_file" = "Atsisiųsti failą";

//Settings and PinCode
"title_app_pin" = "Užrakto kodas";
"title_app_pin_and_touchID" = "Užrakto kodas & Piršto antspaudas";
"title_app_pin_and_faceID" = "Passcode Lock & Face ID";
"title_app_pin_forced" = "Pakeisti užrakto kodą";
"enter_app_pin" = "Įveskite užraktą";
"enter_app_pin_long_description_forced" = "Reikalingas užraktas. Prisijungimui turite susikurti užraktą.";
"enter_app_pin_long_description" = "Įveskite užraktą";
"reenter_app_pin" = "Pakartokite užraką";
"remove_app_pin" = "Pašalinti užraktą";
"both_pass_not_same" = "Nesutampa įvesti užraktai";
"app_pin_incorrect" = "Neteisingas užraktas";
"passcode_not_enabled" = "Pirmiausia įjunkite užraktą";
"title_app_touchID" = "Piršto antspaudas";
"title_app_faceID" = "Face ID";
"disconnect_button" = "Atsijungti nuo šio serverio";
"pin_removed" = "Užraktas pašalintas";
"incorrect_pin" = "Neteisingas užraktas";
"app_pin_stored" = "Užraktas išsaugotas";
"help" = "Pagalba";
"recommend_to_friend" = "Rekomenduoti draugui";
"send_feedback" = "Siųsti atsiliepimą";
"manage_accounts" = "Tvarkyti paskyras";
"add_new_account" = "Pridėti naują paskyrą";
"save_changes" = "Išsaugoti";
"add_account" = "Pridėti";
"user_exist" = "Toks vartotojas jau yra";
"imprint_button" = "Impressum";
"title_instant_upload_photos"="Iš karto įkelti nuotraukas";
"title_instant_upload_videos"="Iš karto įkelti video";
"title_background_instant_upload" = "Automatinis įkėlimas fone";
"accounts_section" = "Paskyros";
"security_section" = "Saugumas";
"instant_updloads_section" = "Momentinis įkėlimas";
"more_section" = "Daugiau";
"unlock_app" = "Atrakinti $appname";
"passcode_forced_can_not_be_disabled" = "Būtinas užraktas. Išjungti negalima.";
"pending_migration_to_new_url" = "Įveskite migravimui į naują URL";

//Downloading
"can_no_copy_to_gallery" = "Šis failas negali būti patalpintas į galeriją nes ji negali atverti tokio failo";
"file_is_downloading" = "Šis failas jau atsiunčiamas";
"download_file_exist" = "Nepavyksta atverti šio failo. Prašome įsitikinti ar jis egzistuoja";
"wait_to_download" = "Ruošiamasi atsiuntimui";
"updating" = "Atnaujinama";
"msg_while_downloads" = "Negalima atlikti šio veiksmo, prašome palaukti kol baigsis dabartinis atsiuntimas";
"streaming_no_possible_ssl_self_signed" = "Nepavyksta pradėti transliacijos nes serverio sertifikatas nėra patikimas. Failas bus automatiškai atsiųstas.";

//SSL
"invalid_ssl_cert" = "Serverio tapatybė negali būti patikrinta. Ar vis tiek norite priimti šį sertifikatą?";
"connection_declined" = "Prisijungimas atšauktas vartotojo";
"server_certificate_untrusted" = "Nepatikimas serverio sertifikatas";

//Recent view
"recent_now"="Prieš kelias sekundes";
"recent_minutes"="prieš $minutes minutes";
"recent_minute"="prieš $minutes minutę";
"recent_hours"="prieš $hours valandų";
"recent_hour"="Prieš $hours valandą";
"recent_days"="Prieš $days dienų";
"recent_day"="Prieš $days dieną";
"recent_months"="Prieš $months mėnesių";
"recent_month"="prieš $months mėnesį";

"uploads_tab"="Įkėlimai";
"current_section"="Dabartinis";
"uploader_section"="Įkelta";
"nothing_was_upload_recently"="Iš šio įrenginio pastaruoju metu niekas neįkelta";
"failed_uploader_section"="Nepavykę įkėlimai";
"clear_successful"="išvalyta sėkmingai";
"error_credential"="Prisijungimo duomenų klaida";
"error_destiny_does_not_exist"="Aplanko klaida";
"error_file_exists"="Konflikto klaida";
"error_permission" = "Teisių klaida";
"error_not_allowed_by_firewall_rule" = "Įkėlimas neleidžiamas";
"error_file_does_not_exist" = "Nepasiekiama įrenginyje";
"error_file_in_background" = "Serverio klaida";
"error_insufficient_storage" = "Nepakanka vietos paskyroje";
"error_file_invalid_characters" = "Netinkami simboliai";
"change_active_user"="Pakeisti aktyvų vartotoją į";
"waiting_for_server"="Laukiama prisijungimo prie serverio";
"waiting_for_upload"="Laukiama įkėlimo";
"error_permission_alert_message" = "Jūs neturite leidimo įkelti į šį katalogą";
"choose_folder" = "Pasirinkti aplanką";

//Select Folder View
"upload_label"="Įkelti į";
"create_button"="Sukurti";
"choose_button"="Pasirinkite";

//Rename
"rename_long_press" = "Pervadinti";
"rename_file_title" = "Pervadinti";
"enter_new_name" = "Įveskite naują pavadinimą:";
"rename_file_exist" = "Failas tokiu pavadinimu jau yra. Pasirinkite kitą pavadinimą.";

//Move
"move_long_press" = "perkelti";
"move_to_label" = "Perkelti į";
"file_exist" = "Failas aplanke jau egzistuoja";
"override_file" = "Ar tikrai norite pakeistį esamą failą šiuo failu? ";
"accept" = "Priimti";
"error_folder_destiny_is_the_same" = "Klaida: negalima perkelti aplanką į jį patį";
"original_file_exist" = "Nepavyksta perkelti šio failo. Prašome įsitikinti ar jis egzistuoja";
"original_folder_exist" = "Nepavyksta perkelti šio aplanko. Prašome įsitikinti ar jis egzistuoja";

//Download folfer
"download_folder" = "Atsisiųsti aplanką";
"cancel_download" = "Atšaukti parsiuntimą";

//Upload from other apps
"other_apps_title" = "Tikslas";
"other_apps_account" = "Paskyra";
"other_apps_folder" = "Katalogas";
"other_apps_file_name" = "Failo pavadinimas";
"other_apps_send_to" = "Įkelti į";
"error_moving_file" = "Nepavyksta perkelti šio failo. Prašome įsitikinti ar nurodytas aplankas egzistuoja";
"forbidden_characters_from_server" = "Failo vardas turi neleistinų simbolių";
"overwritte_title" = "Perrašyti";

//Social
"twitter_message" = "Išbandykite $twitteruser savo išmaniajame telefone!";
"facebook_message" = "Išbandykite $appname savo išmaniajame telefone!\n";
"mail_recommendation_subject" = "Išbandykite $appname savo išmaniajame telefone!";
"mail_recommendation_body" = "Siūlau pabandyti $appname savo išmaniajame telefone!\nParsisiųskite štai čia:";
"device_not_support_mail" = "Prašome nustatyti savo pašto paskyrą";
"mail_feedback_subject" = "Atsiliepimai $appname";
"account_not_configure" = "Jūsų įrenginyje paskyra nėra sukonfigūruota. Eikite į Nustatymus ir ją sutvarkykite.";

//Storage
"of_storage" = "iš";
"occupied_storage" = "užimta";
"storage" = "Saugojimas";
"storage_upgrade" = "Atnaujinti saugyklą";

//Jimmies
"this_file_is_older" = "Išleista naujesnė versija";
"msg_update_file_0_bytes" = "Serveryje šis failas užima 0 baitų. Ar norite įrenginyje esantį failą pakeisti šiuo tuščiu failu iš serverio?";

//Shared
"shared_tab" = "Viešos nuorodos";
"message_not_shared_files" = "Kol kas nesidalijama jokiomis failų/aplankų nuorodomis.";
"message_not_shared_api_support" = "Deja, bendrinimas neįjungtas Jūsų serveryje. Prašome susisiekti su administratoriumi";
"share_link_long_press" = "Dalintis";
"unshare_link" = "Nebesidalinti nuoroda";
"share_not_available_on_this_server" = "Deja, ši funkcija neįjungta Jūsų serveryje. Prašome susisiekti su administratoriumi";
"copy_link" = "Kopijuoti nuorodą";
"file_to_share_not_exist" = "Nepavyksta dalinti šio failo ar aplanko. Prašome įsitikinti ar jis egzistuoja";
"file_to_unshare_not_exist" = "Nepavyksta išjungti šio failo/aplanko bendrinimo. Prašome įsitikinti ar jis egzistuoja";
"shared_link_protected_title" = "Įveskite slaptažodį";
"shared_link_protected_message" = "Norėdami apsaugoti dalinamą nuorodą, sukurkite slaptažodį.";
"pasword_empty" = "Slaptažodis negali būti tuščias";
"no_pasword" = "Slaptažodis privalomas";
"get_share_link" = "Gauti viešą nuorodą";
"title_share_link_option_name" = "Nuorodos pavadinimas";
"title_share_link_option_password" = "Slaptažodis";
"title_share_link_option_expiration" = "Galiojimo laikas";
"title_share_link_option_allow_dowload_view" = "Atsisiųsti / Peržiūrėti";
"title_share_link_option_allow_dowload_view_upload" = "Atsisiųsti / Peržiūrėti / Įkelti";
"title_share_link_option_allow_upload_only" = "Upload only (File Drop)";
"placeholder_share_link_option_name" = "Pavadinimas";
"placeholder_share_link_option_password" = "Pasirinkite slaptažodį";
"placeholder_share_link_option_expiration" = "Galiojimo laikas";
"title_view_create_link" = "Sukurti dalinimosi nuorodą";
"title_view_edit_link" = "Redaguoti dalinimosi nuorodą";
"title_confirm_delete_link" = "Pašalinti nuorodą";
"message_confirm_delete_link" = "! Delete $sharedLink";
"default_link_name" = "$fileName link";
"allow_editing" = "Leisti redaguoti";
"show_error_password_enforced" = "Reikalingas slaptažodis";
"show_error_expiration_enforced" = "The public link will expire no later than $nDays days after it is created";
"default_not_possible_msg" = "Negalima atlikti šio veiksmo, prašome pabandyti vėliau";
"share_user_group_indicator" = "grupė";
"share_user_federated_indicator" = "nutolęs";
"add_user_or_group_title" = "Pridėti vartotoją ar grupę";
"share_with_users_or_groups" = "Naudotojai ir grupės";
"not_share_with_users_yet"= "Kol kas nesidalinama su jokiais vartotojais";
"not_share_by_link_yet"= "Not shared by public link yet";
"not_sharee_api_supported" = "Ši serverio versija nepalaiko dalinimosi su vartotojais. Susisiekite su administratoriumi.";
"share_link_title" = "Viešos nuorodos";
"warning_sharing_public_link" = "Kiekvienas turintis šią nuorodą gali pasiekti failą/katalogą";
"not_share_link_enabled_capabilities" = "Nuorodų dalinimasis neįjungtas Jūsų serveryje. Prašome susisiekti su administratoriumi";
"shared_link_cannot_remove_password" = "Nepavyko pašalinti slaptažodžio";
"shared_link_cannot_remove_expiration_date" = "Nepavyko pašalinti galiojimo laiko. Dalijimaisi privalo turėti galiojimo laiką";
"shared_link_mail_subject" = "$userName pasidalino »$fileOrFolderName« su jumis";
"secured_link" = "Apsaugota";
"message_private_link" = "Private link: Only people who have access to the file/folder can use it. Use it as a permanent link for yourself or to point others to files within shares";

//Shared privileges
"title_user_can_edit" = "Gali redaguoti";
"title_user_can_share" = "Gali dalintis";
"user_can_create" = "sukurti";
"user_can_change" = "keisti";
"user_can_delete" = "ištrinti";
"title_view_edit_user_privileges" = "Teisės";

//Shared Link Options
"title_view_share_link_options" = "Nuorodos nustatymai";

//Favorites
"favorite" = "Mėgiamas";
"unfavorite" = "Nebemėgti";
"parent_folder_is_favorite" = "Aplankas su šiuo failu jau pažymėtas mėgstamu";

//Available offline
"available_offline" = "Pasiekiamas neprisijungus";
"not_available_offline" = "Nepasiekiamas neprisijungus";
"parent_folder_is_available_offline_file_child" = "Aplankas su šiuo failu jau yra pasiekiamas neprisijungus";
"parent_folder_is_available_offline_folder_child" = "Aplankas kuriame yra šis aplankas jau yra pasiekiamas neprisijungus";

//Document provider
"error_login_doc_provider" = "Nepasiekiama paskyra. Pirmiau prašome naudoti $appname prisijungimui.";
"error_sending_file_to_document_picker" = "Klaida siunčiant failą dokumentų parinkimui";
"error_user_change_in_core_app" = "Vartotojas buvo pakeistas $appname programėlėje";
"error_connecting_with_server" = "Šiuo metu neįmanoma prisijungti prie serverio, prašome pabandyti vėliau";
"move_doc_provider_button" = "Perkelti į šią vietą";
"export_doc_provider_button" = "Eksportuoti šią vietą";

//Instant uploads
"location_not_enabled"="Neįjungtas vietos aptikimas";
"message_location_not_enabled"="Momentiniam nuotraukų įkėlimui fone prašome įrenginio Nustatymuose įjungti vietos aptikimą";

"access_photos_library_not_enabled" = "Prieiga prie nuotraukų neįjungta";
"message_access_photos_not_enabled" = "Momentiniam nuotraukų įkėlimui prašome įrenginio Nustatymuose prograėlei leisti prieiti prie nuotraukų.";

//PDF reader
"page_of_pages" = "iš"; //Example: 5 of 10

//Share in
"files_added" = "Failai pridėti";
"files_will_be_upload_next_time" = "Failai bus pradėti įkelti kai kitą kartą atidarysite $appname";

//Help Guide main app
"title_help_slide_0" = "Sveiki atvykę į $appname!";
"message_help_slide_0" = "Braukite norėdami sužinoti daugiau";
"title_help_slide_1" = "Momentinis įkėlimas";
"message_help_slide_1" = "Apsaugokite savo nuotraukas";
"title_help_slide_2" = "Tvarkykite savo failus";
"message_help_slide_2" = "Jūs galite ištrinti, perkelti";
"title_help_slide_3" = "Dalintis";
"message_help_slide_3" = "Jūs galite dalintis failais ir aplankais";
"title_help_slide_4" = "Universali Paskyra";
"message_help_slide_4" = "Prisijunkite prie savo debesų";
"title_help_slide_5" = "Jūsų asmeniniai failai pasiekiami visur";
"message_help_slide_5" = "5";
"sign_in_button_help_guide" = "Prisijungti";
"skip_button_help_guide" = "Praleisti";

//Update Guide main app
"title_update_slide_0" = "Discover the new ownCloud App";
"message_update_slide_0" = "Rebuilt from scratch for iOS 11+";
"title_update_slide_1" = "PDF Viewer";
"message_update_slide_1" = "Easy Search and Navigation";
"title_update_slide_2" = "File Management";
"message_update_slide_2" = "Share Files and Folders";
"title_update_slide_3" = "Quick Access";
"message_update_slide_3" = "Complete Data Overview";
"title_update_slide_4" = "Multiple Accounts";
"message_update_slide_4" = "Access to all your clouds";
"title_update_slide_5" = "Get it for free on the AppStore";
"message_update_slide_5" = "Secure Data Management";
"sign_in_button_update_guide" = "Atsisiųsti";
"skip_button_update_guide" = "Atsisiųsti";

//Account menu
"menu_account_edit" = "Keisti Slaptažodį";
"menu_account_clear_cache" = "Išvalyti talpyklą";
"menu_account_log_out" = "Pašalinti paskyrą";

//Common
"not_connected_to_internet" = "Įrenginys neprijungtas prie tinklo";
"bad_request" = "Bad request";
"method_not_allowed" = "Method not allowed";
"proxy_auth_required" = "Proxy authorization required";
"conflict" = "Konfliktas";
"internal_error" = "Internal server error";
"not_implemented" = "Not implemented";
"bad_gateway" = "Bad gateway";

//Private links
"private_link_redirection_failed" = "The item does not exist";
"error_connecting_with_server" = "Šiuo metu neįmanoma prisijungti prie serverio, prašome pabandyti vėliau";
"private_link_not_reachable" = " Private link could not be opened";
